Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །དེ་ནས་བདུད་ཤོར་བ་ཚུལ་ཁྲིམས་རྟེན་སྔོན་གྱི་ཚེ་རབས་དང་། སྨོན་ལམ་དང་། སངས་རྒྱས་རྣམས་ལ་མཆོད་པ་དང་། དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱིས་བསྐུལ་བས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་རྩྭ་བཀྲམ་བ་ལྟ་བུར་འོངས་པར་གྱུར་ཏེ།
en: At that moment, aroused by his past lives, aspirations, and worship of the buddhas and by all his roots of virtue, the māra leader Support of Discipline was humbled, like scattered grass, in front of the Blessed One.

source: གདོང་མཆི་མ་དང་བཅས་པས་ཐལ་མོ་རབ་ཏུ་སྦྱར་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བྱིས་པ་ཇི་ལྟ་བ་དང་། མྱོས་པ་ཇི་ལྟ་བ་དང་། སེམས་འཁྲུག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ནོངས་པ་འཆགས་ལགས་སོ།
en: With tears in his eyes, he joined his palms and said, “Respected Blessed One, I am like a child, a drunk person, or someone who is mentally disturbed. I confess my faults.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་ནོངས་པ་འཆགས་སོ།
en: Respected Blessed One, I confess my faults!

source: །འདི་ལྟར་བདག་གིས་དྲན་ལགས་ཏེ། གྲངས་མ་མཆིས་པ་གཅིག་རྫོགས་པར་བླ་ན་མ་མཆིས་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བརྩོན་པ་ཆེན་པོས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་སྤྱོད་པ་སྤྱད་ལགས་སོ།
en: I now remember that, for a full uncountable eon, I previously engaged in the practice of the six perfections with great effort in order to reach unsurpassed and perfect awakening.

source: །དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྦྱངས་པ་མང་དུ་བགྱིས་ལགས་སོ།
en: I repeatedly cultivated roots of virtue.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འདས་པ་རྣམས་དང་བཞུགས་པ་བརྒྱ་སྟོང་ཕྲག་བྱེ་བ་ལ་བདག་གིས་བསྙེན་བཀུར་བ་དང་བཀུར་སྟི་རྣམ་པ་སྣ་ཚོགས་བགྱིས་ཏེ་ཆོས་ཀྱང་ཐོས་ལགས་སོ། །སྨོན་ལམ་ཡང་བཏབ་ལགས་སོ།
en: I have previously served and revered a trillion blessed thus-gone ones in a variety of ways. I have heard the Dharma from them, and I made aspirations.

source: །དེ་བཞིན་གཤེགས་པ་འོད་སྲུང་གི་གསུང་རབ་ལ་དགེ་སློང་ལ་ལ་ཉན་ཐོས་ཀྱི་གཏམ་རྗེས་སུ་བསྐུལ་བར་བགྱིད་ལགས་ཏེ།
en: Once, during the lifetime of the thus-gone Kāśyapa, a monk was requesting a discourse of the vehicle of the hearers.

source: དེ་ནས་བདག་གིས་མ་བསམས་པར་ཀྱེ་མ་དགེ་སྦྱོང་གི་ལུས་བྱད་ཀྱིས་གང་ཟག་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཀྱི་མདུན་དུ་ཉན་ཐོས་ཀྱི་གཏམ་འཆད་པ་འདི་ནི་བདུད་དོ་ཞེས་སྡིག་པ་ཅན་གྱི་ཚིག་བརྗོད་ལགས་ཏེ། དེར་གལ་ཏེ་བདག་གིས་སྡིག་པ་ཅན་གྱི་ཚིག་དེ་མ་སྨྲས་པར་གྱུར་ན་ནི་དེར་བདག་གིས་བླ་ན་མ་མཆིས་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་ཐོབ་པར་འགྱུར་ལགས་ན།
en: Without thinking, I then spoke these evil words: ‘Alas! This exposition on the hearers’ discourses in the presence of followers of the Great Vehicle, given while assuming the appearance of a spiritual practitioner is demonic!’ If I had not said those evil words at that time, I would have received a prophecy for unsurpassed and perfect awakening.

source: སུག་ལས་ཀྱི་ལྷག་མ་དེས་བདག་དེ་ནས་ཤི་འཕོས་ནས་བདུད་ཀྱི་གནས་སུ་སྐྱེས་ཏེ།
en: However, due to the karmic residue of that action, I was born in the abode of Māra after I died.

source: དགུང་ལོ་བྱེ་བ་ཕྲག་ལྔ་བཅུ་རྩ་བདུན་དང་། དགུང་ལོ་བརྒྱ་སྟོང་དག་ཏུ་དེར་བླ་ན་མ་མཆིས་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་བདག་གི་སེམས་བསྐྱེད་པ་གཅིག་ཀྱང་མ་བྱུང་ལགས་ན་ཚངས་པའི་གནས་པ་རྣམས་ལ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་ལགས་ཞེས་དེ་བཞིན་གཤེགས་པ་འཁོར་དང་བཅས་པ་ལ་ལན་གཉིས་ཀྱི་བར་དུ་བཟོད་པ་གསོལ་ཏོ།
en: For five hundred seventy million years, and then a hundred thousand more, I did not have a single thought aimed at unsurpassed and perfect awakening, so what need is there to mention practicing the sublime states?” Repeating these words, the māra leader Support of Discipline apologized to the Thus-Gone One and his retinue.

source: །ཇི་སྲིད་དུ་སྔོན་གྱི་མཐའི་འཁོར་བར་འཁོར་བ་དེ་སྲིད་དུ་སླད་ཀྱིས་ཕྱི་མའི་མཐའི་མུར་སེམས་ཅན་དམྱལ་བར་གནས་པར་སྤྲོ་ལགས་ཀྱི། བླ་ན་མ་མཆིས་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་སེམས་ལྡོག་པར་ནི་མི་བགྱིད་ལགས་སོ།
en: He then exclaimed, “From now on I would rather remain in the hell realms for as long as I have so far been circling in saṃsāra than let my mind stray from unsurpassed and perfect awakening!”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ལེགས་སོ་ལེགས་སོ།
en: The Blessed One replied, “Excellent, noble son!

source: །གང་ལ་ལ་སྙིང་རྗེའི་སེམས་ཀྱིས་བྱང་ཆུབ་ཏུ་སེམས་གཞོལ་བར་བྱེད་ན། འདི་ནི་འདྲེན་པ་རྣམས་ལ་མཆོད་པ་མཆོག་དང་ཕུལ་ཡིན་ཏེ།
en: Those who dedicate themselves to the mind set on awakening with a compassionate attitude are making the most outstanding gift to the great guides.

source: འདྲེན་པའི་སྤྱན་སྔར་ལ་ལ་མར་མེ་རི་རབ་ཙམ་དུ་འབར་བར་བྱེད་ཀྱང་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་སྙེད་ཡོངས་སུ་བཟུང་བ་མ་ཡིན་གྱིས་ཁྱོད་ལོངས་ཤིག །ང་ལ་སྡིག་པའི་ལས་སྲ་བ་འོར་ཅིག །ཕུང་པོ་དང་ཁམས་འདི་དག་ལ་སྤྲོས་པ་དང་། མཚན་མ་མེད་པ་དང་། འདུས་བྱས་ཐམས་ཅད་དྲན་པར་བྱོས་ཤིག་དང་། ཁྱོད་ཡོན་ཏན་མཆོག་ཏུ་ཁ་ལོ་སྒྱུར་བར་འགྱུར་རོ།
en: Even the merit of lighting lamps as big as Mount Sumeru in front of the great guides would not match that heap of merit. Therefore, adopt this attitude! Surrender this strong negative karmic action to me! Remember that the aggregates and elements are devoid of concepts and marks—they are conditioned! Then you will become a leader with supreme qualities.”

source: །དེ་ནས་དེ་ཉིད་ཀྱི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་རྟེན་གྱིས་རྗེས་སུ་འཐུན་པའི་ཆོས་རྣམས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་རྟེན་སྟན་ལས་ལངས་ཏེ།
en: At that very moment, the bodhisattva great being Support of Discipline achieved the concordant acceptance with respect to phenomena.

source: བཅོམ་ལྡན་འདས་ལ་རིན་ཐང་མེད་པའི་མུ་ཏིག་གི་རྒྱན་ཕྲེང་གིས་སྐུ་ལ་གཡོགས་ནས་གསོལ་པ།
en: Then, he stood up, draped the body of the Blessed One with garlands made of invaluable pearl jewelry, and asked,

source: གང་བདག་ཅག་གིས་ཆོས་ཐམས་ཅད་མྱུར་དུ་རྟོགས་ནས་དབུ་བ་དང་འདྲ་བའི་ལྟ་བ་ཐམས་ཅད་ཡང་དག་པར་འཇོམས་པར་བགྱིད་པ་དང་།
en: “What are the qualities that will cause us to quickly understand all phenomena and destroy all views as if they were water bubbles?

source: བྱང་ཆུབ་ཏུ་ནི་བཟོད་པ་མཆོག་ཐོབ་པར་འགྱུར་བ་དང་། ཡུན་རིང་པོ་མི་ཐོགས་པར་སེམས་ཅན་ཐམས་ཅད་ཐར་བར་བགྱིད་པའི་ཆོས་ནི་གང་ལགས།
en: What are the qualities that will cause us to achieve the supreme acceptance set on awakening and quickly liberate all beings?

source: གང་ཞིག་ནི་བྱང་ཆུབ་སེམས་དཔས་སྤང་བའི་སླད་དུ་བསྒོམ་པར་བགྱིད་པ་ལགས།
en: What should the bodhisattvas cultivate for the sake of abandonment?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཚུལ་ཁྲིམས་རྟེན་མཁས་པས་ཆོས་བཞི་མྱུར་དུ་བསྐྱེད་པར་བྱ་སྟེ།
en: The Blessed One replied, “Support of Discipline, the wise ones must quickly generate four qualities.

source: སེམས་ཅན་གྱི་ཕྱིར་སྡུག་བསྔལ་ཚད་མེད་པ་ཐམས་ཅད་ལ་སྤྲོ་བར་བྱ་བ་ཡིན། སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་བསླབ་པ་དཔག་ཡས་པ་གཟུང་བར་བྱ་བ་ཡིན། མ་ཉམས་པར་གཟུང་བར་བྱ་བ་ཡིན། སངས་རྒྱས་ཀྱི་ཆོས་དཔག་ཏུ་མེད་པ་ཐམས་ཅད་མྱུར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ཡིན་ནོ།
en: (1) Enthusiastically accepting boundless suffering for the sake of others, (2) undertaking the endless trainings of the buddhas’ domain, (3) undertaking them without letting them regress, and (4) quickly perfecting all the limitless buddha qualities.”

source: །ཡང་དེའི་ཚེ་ཚུལ་ཁྲིམས་རྟེན་གྱི་འཁོར་བདུད་ཀྱི་སྡེ་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དེ་དག་གིས་ལུང་བསྟན་པ་དེ་ཐོས་ནས་དེ་བཞིན་གཤེགས་པ་ལ་དད་པ་དང་དང་བ་མཆོག་སྐྱེས་ཤིང་གུས་པ་སྐྱེས་ནས། བཅོམ་ལྡན་འདས་ལ་ལྷག་པའི་བསམ་པས་བཟོད་པ་གསོལ་བར་གྱུར་ཏོ།
en: When they heard that teaching, supreme trust, faith, and respect arose in the minds of the eighty-four thousand māras in the retinue of Support of Discipline, and they sincerely apologized to the Blessed One.

source: །དེའི་ཚེ་དེ་དག་གིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་སྟེ། དེ་དག་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗེད་པའི་ཏིང་ངེ་འཛིན་ཐོབ་བོ།
en: They also made aspirations to reach unsurpassed and perfect awakening, and they all achieved the absorption that does not forget the mind of awakening.

source: །བཅོམ་ལྡན་འདས་ལ་དེ་དག་གིས་རང་རང་གི་ལྷ་རྫས་ཀྱི་ཆོས་གོས་དག་སྐུ་ལ་གསོལ་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: They draped the body of the Blessed One with Dharma robes made of divine substances and then sat to one side.

source: །བདུད་སྡིག་ཅན་གྱིས་མཐོང་སྟེ། མཐོང་ནས་ཀྱང་ཡང་ཤས་ཆེར་འཁྲུགས་ཤིང་སྐྲག་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །དགེ་སྦྱོང་གི་ནི་ལྟོར་ཆུད་པས། །འཁོར་དེ་དག་དང་བྲལ་བར་གྱུར།
en: When he saw this, the evil Māra became exceedingly distressed and scared. He shouted, “They have been consumed by the spiritual practitioner, so now I have lost those retinues!

source: །འདི་ནས་གང་དུ་དོང་བ་ནི། །ཐམས་ཅད་དེ་ཡི་དབང་དུ་སོང་།
en: All those who left from here have fallen under his power, so no one can go outside anymore!

source: །དེས་སུ་ཡང་ཕྱི་རོལ་དུ་མ་འབྱུང་ཤིག །བདུད་ཀྱི་སྤྱོད་ཡུལ་འདིར་བདག་ཅག་གནས་པར་བྱའོ་ཞེས་སྨྲས་ནས་མྱུར་དུ་གྲོང་ཁྱེར་གྱི་སྒོ་བཅད་དེ་གབ་ཏུ་བཅུག་གོ།
en: We must remain here in this domain of the māras!” As he shouted this, he quickly closed the city gates and had guards protect them.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་ཇི་ལྟར་ནམ་མཁའི་སྤྱན་ལས་གསུངས་པ་བཞིན་དུ་དེ་དག་ལ་ཚངས་པའི་གནས་པ་རྣམ་པ་གསུམ་པོ་སེམས་ཅན་ལ་དམིགས་པ་དང་། ཆོས་ལ་དམིགས་པ་དང་། དམིགས་པ་མེད་པ་རྒྱ་ཆེར་བསྟན་པར་ཡང་དག་པར་བརྩམ་པ་མཛད་དོ།
en: Then, with his sky-like vision, the Blessed One began to give extensive teachings about the three pure abodes—the focus on sentient beings, the focus on phenomena, and the absence of focus.

source: །རི་ཁ་ལ་ཏི་ཡའི་རྩེ་མོ་དྲང་སྲོང་ཐུབ་པའི་གནས་སུ་ཀླུ་གང་དག་རྟེན་ཅིང་འདུས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་རང་རང་གི་ལུས་ཆུང་ངུར་མཐོང་སྟེ། དཔེར་ན་མིག་སྨན་བསྐུ་བའི་ཐུར་མ་བཞིན་ནོ། །ཇི་ལྟར་སྔོན་གྱི་ལུས་བཞིན་དུ་ཡང་བཞག་པར་མ་ནུས་སོ། །སླར་འབྱུང་བར་ཡང་མ་ནུས་ཏེ།
en: All the nāgas who had found shelter and gathered at the sacred site of wise sages at the summit of Mount Kalatiya now noticed that their bodies had become as small as the pin used to apply ointment to the eyes, but they were unable to restore their bodies to their normal size.

source: དེ་དག་ཐམས་ཅད་འཇིགས་ཤིང་སྐྲག་ལ་སྤུ་ཟིང་ཞེས་བྱེད་པའི་བ་སྤུའི་ཁུང་བུ་བྱུང་ནས།
en: They became filled with fear and terror, and their hairs stood on end.

source: དེ་དག་ཐམས་ཅད་ཀྱིས་དགའ་བོ་དང་ཉེ་དགའ་ལ་རབ་ཏུ་བཏུད་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །གང་གི་ཚེ་བདག་ཅག་གི་གྲོང་དུ་ཤ་སྦྲང་དང་། སྦྲང་བུ་མཆུ་རིངས་དང་། སྦྲང་བུ་གདུག་པ་རྣམས་ཀུན་ཏུ་བྱུང་བ་དེའི་ཚེ་བདག་ཅག་གནས་ཐམས་ཅད་བོར་ནས་བསྐྱབ་པའི་ཕྱིར་འདིར་ཞུགས་ནས་འདི་ནས་གང་དུ་ཡང་མཆི་བར་མ་ནུས་ཏེ།
en: So they all bowed toward Nanda and Upananda and supplicated, “When those flesh flies, mosquitoes, and hornets appeared in our towns, we all left our homes and entered this realm to find shelter.

source: ལུས་དག་ཀྱང་ཆུང་ངུར་གྱུར་ལགས་ན་གང་གིས་བདག་ཅག་གནས་སུ་མཆི་བར་བདག་ཅག་བསྐྱབ་ཏུ་གསོལ།
en: But now we are unable to leave again, and our bodies have become tiny. Please protect us so that we may return to our homes!

source: མི་འཇིགས་པ་སྩལ་བར་གསོལ།
en: Please grant us fearlessness!”

source: དགའ་བོ་དང་ཉེ་དགའ་གཉིས་ཀྱིས་ཀྱང་སྨྲས་པ།
en: Nanda and Upananda replied:

source: དགེ་སྦྱོང་འདི་ནི་གཡོ་སྒྱུ་ཅན་གྱིས་བློ།
en: “This spiritual practitioner is deceitful.

source: །ཤཱཀྱའི་བུ་ཕོ་སྒྱུ་མ་བྱེད་པ་ཡིན།
en: The son of the Śākyas is performing magical tricks.

source: །སངས་རྒྱས་ཞིང་འདིར་ཞུགས་པར་གྱུར་ནས་སུ།
en: He has entered this buddha realm

source: །ལུས་ཀུན་ལ་ནི་ཐམས་ཅད་ཆུད་པར་གྱུར།
en: And then absorbed it all into his body.

source: །དེས་ནི་ཀླུ་རྣམས་ཀུན་གྱི་གནས་དག་ཏུ། །ཤ་སྦྲང་སྦྲང་བུ་མཆུ་རིངས་སྦྲང་བུ་སྦྲུལ།
en: “He has manifested those flesh flies, mosquitoes, and hornets In all the abodes of the nāgas.

source: །ས་འདི་བསྐྱབ་ཕྱིར་ངེད་ཅག་ལྷགས་གྱུར་ཏེ།
en: We have come to this place to find shelter,

source: །ཐམས་ཅད་སྟོབས་རྣམས་ལས་ནི་ཉམས་པར་གྱུར།
en: And our strengths have declined.

source: །གཽ་ཏ་མ་ནི་བློ་གྲོས་གཡོན་ཅན་ཡང་།
en: “Although Gautama has a cunning intelligence,

source: །ལས་དེས་རྫུ་འཕྲུལ་དེ་ལས་ཉམས་གྱུར་ཅིང་།
en: Through his actions his magical powers have now declined,

source: །དེ་ནི་ལུས་ཀྱང་ཆུང་ངུར་གྱུར་ནས་སུ།
en: And his own body has also become small.

source: །སྟན་གྱི་སྟེངས་ན་དམངས་ནི་ཀུན་ཏུ་སྣང་།
en: This commoner now appears sitting on his seat.

source: །དེས་ནི་བདག་ཅག་ལུས་ཀྱང་ཆུང་ངུར་བྱས།
en: “He reduced the size of our bodies

source: །བཙོན་ར་འདིར་ནི་བཅིངས་པར་གྱུར་ནས་སུ།
en: And bound us inside this prison.

source: །ངེད་ཅག་ཅི་ཡང་བྱེད་པར་མི་ནུས་ཀྱིས།
en: We are unable to do anything,

source: །མི་འཇིགས་ལྷ་ལ་ཁྱེད་ཅག་ཕྱག་འཚོལ་ཅིག །
en: So you must pay homage to the fearless god!”

source: འདོད་པའི་དབང་ཕྱུག་བདུད་སྡིག་ཅན་ལ་ཀླུ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཕྱག་འཚལ་ཏེ་སྨྲས་པ། གང་བདག་ཅག་བཙོན་ར་དེ་ནས་འབྱེར་བ་དང་རང་རང་གི་གནས་རྣམས་སུ་གནས་པར་རྔོ་ཐོགས་པར་བདག་ཅག་བསྐྱབ་ཏུ་གསོལ།
en: So all the nāgas paid homage to the evil Māra, the lord of the desire realm, saying, “Please protect us, so that we may be able to escape from this prison and live again in our own homes!”

source: ཀླུའི་རྒྱལ་པོ་ས་སྲུང་གི་བུས་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The nāga king Airāvaṇa then said to them:

source: །བདུད་དཔུང་བཅས་པ་རང་ཉིད་སྐྲག་ནས་སུ།
en: “Māra and his armies are themselves frightened

source: །གཽ་ཏ་མ་སྒྱུ་མ་གཡོ་སྒྱུ་ཅན་ལ་སྐྱོ།
en: And distressed by the cunning tricks of Gautama.

source: །འཁོར་དང་ལྟོ་གོལ་རྣམས་ཀྱང་གཡོ་ཡིས་སུ། །དེས་ནི་དེ་ཡི་སྐྱེ་བོ་མང་པོ་ཕྲོགས།
en: He has taken away many of his followers By deceiving his retinues and followers.

source: །བདུད་ལ་མཐུ་ནི་ཅི་ཡང་ཡོད་མ་ཡིན།
en: “Māra has no power whatsoever;

source: །འགྲོ་བ་དང་ནི་རྫུ་འཕྲུལ་དེ་ལས་ཉམས།
en: His movements and magical powers have declined.

source: །གཞན་ལ་ཁྱེད་ཅག་མྱུར་དུ་སྐྱབས་སུ་དེང་། །ལྷ་རྣམས་ལ་ནི་ཀུན་གྱིས་རྗེད་པར་བྱོས། །
en: Quickly go and seek protection in other beings! All of you must honor the gods!”

source: དེ་ནས་ཀླུ་ཐམས་ཅད་ཀྱང་ཁ་ཅིག་ནི་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་ཕྱག་འཚལ་བར་བྱེད་དོ། །ཁ་ཅིག་ནི་བརྒྱ་བྱིན་ལ་ཕྱག་འཚལ་བར་བྱེད་དོ། །ཁ་ཅིག་ནི་རབ་འཐབ་བྲལ་ལ་ཕྱག་འཚལ་བར་བྱེད་དོ། །ཁ་ཅིག་ནི་ཡོངས་སུ་དགའ་ལྡན་ལ་ཕྱག་འཚལ་བར་བྱེད་དོ། །ཁ་ཅིག་ནི་འཕྲུལ་དགའ་ལ་ཕྱག་འཚལ་བར་བྱེད་དོ། །ཁ་ཅིག་ནི་ལྷའི་བུ་གཞན་འཕྲུལ་དབང་བྱེད་ལ་ཕྱག་འཚལ་བར་བྱེད་དོ། །ཁ་ཅིག་ནི་ཚངས་པ་ཆེན་པོ་ལ་ཕྱག་འཚལ་བར་བྱེད་དོ།
en: Some of the nāgas then paid homage to the Four Great Kings, some paid homage to Śakra, some paid homage to the supreme god in the Heaven Free from Strife, some paid homage to the supreme god in the Heaven of Joy, some paid homage to the gods in the Heaven of Delighting in Emanations, some paid homage to the gods in the Heaven of Making Use of Others’ Emanations, and some paid homage to the mahābrahmās.

source: །ཀླུའི་རྒྱལ་པོ་ཐམས་ཅད་ལ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The nāga king Sāgara then said to all the other nāga kings:

source: །ལྷ་དང་ལྷ་དབང་འདི་ཀུན་འཁོད་ནས་སུ། །མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་བྱེད་པ་དང་། །གཽ་ཏམ་དམངས་ལ་ཐམས་ཅད་སྐྱབས་གནས་པ། །ཁྱེད་ཅག་གི་ནི་ཅི་ཡི་ཕྱིར་མ་མཐོང་།
en: “Why do you not see That all the gods and their rulers are sitting around Gautama? They make various offerings to him, And they have all taken refuge in this śūdra!

source: །དཀའ་ཐུབ་དྲག་པོ་དྲང་སྲོང་ཆེན་པོ་དག །གཞན་རྣམས་ལ་ནི་གྲོགས་དག་ཁྱེད་ཕྱག་འཚོལ།
en: “Friends, instead pay homage to other great sages Who undergo intense ascetic practices!

source: །རྟས་བསྲུངས་མཐོན་འཕུར་སྐར་མ་དགའ་བ་དང་། །ངན་སྤོང་བུ་ལ་ཅི་ཕྱིར་ཕྱག་མི་འཚལ།
en: Why not pay homage to Protecting Guardian, High Flier, Jyotīrasa, and Bhārgava?”

source: །དེ་ནས་ཀླུ་དེ་དག་ཐམས་ཅད་ཁ་ཅིག་ནི་དྲང་སྲོང་རབ་ཏུ་དཔལ་ལྡན་ལ་ཕྱག་འཚལ་བར་བྱེད་དོ། །ཁ་ཅིག་ནི་བརྟེན་པོ་ལ་ཕྱག་འཚལ་བར་བྱེད་དོ། །ཁ་ཅིག་ནི་རྟས་བསྲུངས་ལ་ཕྱག་འཚལ་བར་བྱེད་དོ། །ཁ་ཅིག་ནི་མཐོན་པོར་འཕུར་ལ་ཕྱག་འཚལ་བར་བྱེད་དོ། །ཁ་ཅིག་ནི་སྐར་མ་ལ་དགའ་བ་ལ་ཕྱག་འཚལ་བར་བྱེད་དོ།
en: Some of the nāgas then paid homage to the sage Utterly Glorious, some paid homage to the sage Stable, some paid homage to Protecting Guardian, some paid homage to High Flier, some paid homage to Jyotīrasa, and some paid homage to Bhārgava.

source: །ཁ་ཅིག་ནི་དྲང་སྲོང་ངན་སྤོང་གི་བུ་ལ་ཕྱག་འཚལ་བར་བྱེད་དོ། །མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་དེ་དག་ལ་སྐྱབས་སུ་ཉེ་བར་དོང་ངོ་།
en: Then, in search of protection, they approached those beings endowed with the five higher perceptions.

source: །ཡང་དེའི་ཚེ། དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་དེ་དག་གངས་ཀྱི་ནུབ་ཕྱོགས་ཀྱི་ངོས་ལ་དྲང་སྲོང་སྐར་མ་ལ་དགའ་བའི་མདུན་ན། ཤཱཀྱ་ཁྱུ་མཆོག་གི་ཡོན་ཏན་བསྔགས་པ་ཉན་ཅིང་འཁོད་དེ། དྲང་སྲོང་དེ་དག་གིས་ཀླུ་ཐམས་ཅད་འོ་དོད་འབོད་པ་ཐོས་སོ། །
en: At that time, those sages endowed with the five higher perceptions were sitting on the western slope of the snow mountain, listening to the praises of the leader of the Śākyas in front of the sage Jyotīrasa.

source: ཐོས་ནས་ཀྱང་དྲང་སྲོང་ལྔ་པོ་དེ་དག་སྟན་ལས་ལངས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐར་མ་ལ་དགའ་བ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཅོམ་ལྡན་འདས་དྲང་སྲོང་ཐུབ་པའི་གནས་རྟེན་དུ་ཀླུ་ཐམས་ཅད་གནོད་པར་གྱུར་ཅིང་བདག་ཅག་ལ་སྐྱབས་སུ་ཉེ་བར་གནས་པ་གཟིགས་སམ།
en: When they heard the lamenting calls of all those nāgas, the five sages stood up and said to the bodhisattva great being Jyotīrasa, “Do you see that the Blessed One is harming all the nāgas in that sacred site of wise sages and that they are approaching us in search of protection?

source: བཞེངས་ཏེ་དེར་བཞུད་ལ་ཀླུའི་སྡེ་ཐམས་ཅད་ཡོངས་སུ་ཐར་བར་མཛོད་ཅིག །དེས་སྨྲས་པ།
en: Please get up, go there, and liberate all those groups of nāgas!” Jyotīrasa replied,

source: ཁྱེད་དེང་ཤིག །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་བརྒྱ་སྟོང་ཕྲག་མང་པོ་འདི་དག་ངའི་མདུན་དུ་འཁོད་ནས་ཚངས་པའི་གནས་པ་དམིགས་པ་མེད་པ་ཡོངས་སུ་འདྲི་བར་བྱེད་དེ། ངས་དེ་དག་གི་སེམས་ཡོངས་སུ་མགུ་བར་བྱའོ། །
en: “Go meet them! Once those many hundreds of thousands of gods, nāgas, and yakṣas sit in front of me, they will ask questions about the sublime states devoid of reference point, and I will satisfy their minds.”

source: དེ་ནས་སྐར་མ་ལ་དགའ་བའི་རྐང་པ་གཉིས་ལ་དྲང་སྲོང་དེ་དག་ཐམས་ཅད་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས་རྫུ་འཕྲུལ་གྱིས་དོང་སྟེ་དྲང་སྲོང་ཐུབ་པའི་གནས་ཀྱི་གཞི་རྟེན་དུ་འཁོད་དོ། །
en: All the sages prostrated to the feet of Jyotīrasa, circumambulated him three times, and departed using their miraculous powers.

source: དེ་ནས་དེ་དག་ལ་ཀླུ་དེ་དག་མགོ་བོས་ཕྱག་འཚལ་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁྱེད་བསོད་ནམས་ཅན་ཤེས་རབ་དང་ལྡན་པ་ཐབས་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲང་སྲོང་ཆེན་པོ་ལགས་ན་བདག་ཅག་ཡོངས་སུ་བསྐྱབ་པར་གསོལ། །བཙོན་རའི་འཇིགས་པ་འདི་ལས་བདག་ཅག་ཡོངས་སུ་དགྲོལ་བར་གསོལ།
en: When they arrived at the sacred site of wise sages, the nāgas prostrated to them and supplicated, “If you are great sages endowed with merit and insight who have mastered all methods, please protect us and release us from the fears of this prison!”

source: དེ་ནས་དྲང་སྲོང་དེ་དག་གིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ངེད་ཀྱིས་ནི་ཁྱེད་འདི་ནས་ཡོངས་སུ་གྲོལ་བར་བྱེད་པར་མི་ནུས་སོ།
en: The sages replied, “We are not able to liberate you from this place.

source: །ལག་འགྲོའི་བདག་པོ་དག་གངས་ཀྱི་ནུབ་ཕྱོགས་ཀྱི་ངོས་ལ་དྲང་སྲོང་ཐམས་ཅད་ཀྱི་བླ་མ་དབང་ཆེ་བར་གྲགས་པ།
en: Nāga lords, on the western slope of the snow mountain lives the master of all the sages. He is called Jyotīrasa.

source: ཤེས་རབ་དང་། ཐབས་དང་། གཟི་བརྗིད་ཆེན་པོས་རྒྱས་པ་སྐར་མ་ལ་དགའ་བ་ཞེས་བྱ་བ་ཡོད་དེ།
en: He is renowned for his great power and has developed great insight, skill, and majesty.

source: དེས་ཁྱེད་འདི་ནས་ཡོངས་སུ་གྲོལ་བར་བྱེད་པར་འགྱུར་རོ།
en: He will liberate you from this place.

source: །དེ་ལ་ཕྱག་འཚོལ་ཅིག །དེ་ཐོས་ནས་ཀླུ་ཐམས་ཅད་དྲང་སྲོང་སྐར་མ་ལ་དགའ་བ་ལ་ཐལ་མོ་རབ་ཏུ་སྦྱར་བ་བྱས་ནས་དབྱངས་གཅིག་གིས་འོ་དོད་བོས་སོ།
en: Go pay homage to him!” When they heard those words, all the nāgas joined their palms in the direction of the sage Jyotīrasa and called for help in unison.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དྲང་སྲོང་གི་ཆ་བྱད་ཅན་དྲང་སྲོང་སྐར་མ་ལ་དགའ་བས་ལྷ་དང་། མི་འམ་ཅི་དང་། གནོད་སྦྱིན་བརྒྱ་སྟོང་ཕྲག་མང་པོས་མདུན་དུ་བདར་ཅིང་ཡོངས་སུ་བསྐོར་ཏེ། དེ་ནས་རྫུ་འཕྲུལ་གྱིས་ཆས་ནས་དྲང་སྲོང་ཐུབ་པའི་གནས་དེར་ཡང་ཕྱིན་པར་གྱུར་ཏེ།
en: Then, with the appearance of a sage, the bodhisattva sage Jyotīrasa miraculously left his place and arrived at the sacred site of wise sages, surrounded and attended by many hundreds of thousands of gods, kinnaras, and yakṣas.

source: དེ་ལ་ཀླུ་ཐམས་ཅད་མགོ་བོས་ཕྱག་འཚལ་ཏེ་གུས་པ་མཆོག་སྐྱེས་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །གང་བདག་ཅག་རང་གི་གནས་སུ་མཆིས་ནས་དགའ་བར་འགྱུར་བར་བདག་ཅག་ཡོངས་སུ་བསྐྱབ་པར་གསོལ།
en: All the nāgas prostrated to him and supplicated him with utmost respect, “Please protect us so that we may return to our residences and live happily!

source: གནས་འདི་ནས་བདག་ཅག་ཡོངས་སུ་དགྲོལ་བར་གསོལ།
en: Please liberate us from this place!”

source: དུས་ཤེས་པ། དུས་ལ་བལྟ་བ་དྲང་སྲོང་ཆེན་པོ་དེས་ཀྱང་རྐྱེན་གྱི་དབང་གིས་དེ་དག་ལ་རྒྱུ་སྐར་གྱི་གོ་རིམས་ཀྱི་གཏམ་བརྩམས་པ།
en: Through the power of circumstances, the great sage, who was observing time and had knowledge about it, started to talk to them about the order of the lunar mansions:

source: ཇི་ལྟར་ཐམས་ཅད་ཐར་འགྱུར་བ། །དེ་བཞིན་དུ་ནི་བཤད་པར་བྱ།
en: “I will explain to you how You can all be free.

source: །ཁྱེད་ལ་ཕན་པ་གཞན་མེད་ཀྱིས། །མཐར་གྱིས་སུ་ནི་མཉན་པར་གྱིས།
en: Nothing else will be of benefit to you, So listen to this attentively!

source: །འདིར་ནི་ནབ་སོ་གང་གནས་པ། །
en: “We are now in Punarvasu,

source: དེ་ནི་དབྱར་ཟླ་ཐ་ཆུངས་ཏེ།
en: And it is the last month of the summer.

source: །དེ་ནི་ཉི་མ་ལྷ་ཡིན་ཞིང་།
en: It is the solar deity,

source: །ཀླུ་རྣམས་ཀུན་དང་འབྲེལ་པ་ཡིས།
en: And it is connected to all the nāgas.

source: །སྐར་མའི་དཔྱད་ནི་ཕོངས་པ་དང་། །སྙིང་པོར་དྲང་སྲོང་སྦྱོར་བས་བསྟན། །
en: “Since you do not engage In the observation of the stars, This sage will teach you By condensing this topic to its essence.”

source: གཟའ་དང་རྒྱུ་སྐར་སྐར་མ་རྣམས། །ནམ་མཁའ་ལ་ནི་སུ་ཡིས་བཞག །
en: The nāgas said: “Who placed the planets And the stars of the lunar mansions in the sky?

source: མཁས་པ་རྣམས་ནི་དགའ་བགྱིད་པ། །ལོ་སྐོར་ཤེས་པ་བཤད་དུ་གསོལ། །
en: Please expound to us the knowledge Of the yearly cycle that delights the wise ones!

source: ཟླ་བ་ཉི་མ་རྒྱུ་སྐར་དང་། །གཟའ་རྣམས་འགྲོ་བ་ཇི་ལྟར་ལགས།
en: “How are the moon, the sun, The lunar mansions, and the planets coursing?

source: །ཟླ་བ་རྣམས་ཀྱི་དང་པོར་ནི། །རྒྱུ་སྐར་གང་ཞིག་འབྱུང་བར་འགྱུར།
en: Which lunar mansion will appear During the first month?

source: །ཟླ་བའི་ཡུད་ཙམ་གང་ཞིག་ལགས།
en: “What are the muhūrtas of the different months?

source: །གོ་རིམས་ཀྱང་ནི་ཅི་འདྲ་ལགས།
en: What is their sequence?

source: །ལྷ་ནི་ཅི་ལགས་རུས་ཅི་ལགས།
en: What is their deity? What is their family?

source: །ལྕི་བ་ཅི་ལགས་ཡང་བ་གང་།
en: What is their heaviness? What is their lightness?

source: །ཕན་པ་ཅི་ལགས་གནོད་པ་ཅི།
en: “What are their benefits? What is their harm?

source: །སྟོབས་ཅི་བདག་ལ་མྱུར་དུ་གསུངས།
en: What are their strengths? Please tell us quickly about this!

source: །གང་གིས་སུ་ནི་མཚན་མོ་འཐོབ།
en: What brings about the night?

source: །ཉི་མའི་མདུན་ན་ཅི་ཞིག་ལགས། །
en: What is in front of the sun?

source: གྲིབ་མའི་གོམ་པ་དུ་ཞིག་ཏུ། །ཉི་མ་འཁོར་བར་བགྱིད་པ་ལགས།
en: “How many steps of shadow are there When the sun circles around?

source: །ཟླ་བ་གང་ལ་ལྷོ་ཕྱོགས་སུ།
en: During which month is the sun in the south?

source: །ཉི་མ་བྱང་དུ་ཇི་ལྟར་གནས།
en: How does it reside in the north?

source: །དྲང་སྲོང་ཁྱོད་ལ་ཀུན་ཞུ་ན།
en: “Sage, we ask all these questions to you.

source: །བདག་ཅག་ལ་ནི་ཀུན་སྟོན་ཅིག །ཤེས་རབ་ཆེན་པོས་འཇིག་རྟེན་མཁས། །སྐར་ལ་དགའ་བས་དེ་སྐད་སྨྲས།
en: Please teach us all this!” Through his great insight, The expert of the world Jyotīrasa replied,

source: །བསྐལ་པ་བཟང་པོ་ཞུགས་པ་ན། །སྔོན་ཆད་བྱུང་བ་སྐྱེ་ལགས་འགྲོ། །དཔལ་ལྡན་གྲོང་ཁྱེར་ལྔ་ལེན་དུ།
en: “O nāgas! In the past, At the beginning of the fortunate eon, A wealthy human king appeared In the glorious city of Pañcālā.

source: །འདོད་པ་སྤངས་ཤིང་ཆོས་དང་ལྡན།
en: “He had given up desires, he was righteous,

source: །གཙང་མ་འདོད་ཅིང་རབ་མཁས་པའི། །མི་རྒྱལ་འབྱོར་བ་ཆེན་པོ་བྱུང་།
en: He wished for chastity, and he was very learned,

source: །དེ་ཡི་བཙུན་མོ་དམ་པ་ནི། །འདོད་པ་རྣམས་ལ་འཆུམས་གྱུར་ནས།
en: But his queen Longed for sensual pleasure.

source: །དེ་ཚེ་ཡུལ་ནི་དབེན་པར་ཡང་། །གཟུ་ལུམས་ཅན་དང་ལྷན་ཅིག་སྤྱད། །མངལ་ནི་སྨིན་པར་བྱ་བའི་ཕྱིར། །ཡང་དང་ཡང་དུ་སྤྱད་ནས་སུ།
en: “At that time, she associated with a reckless man And fornicated with him repeatedly In a place without other people, With the aim of becoming pregnant.

source: །དེ་ཚེ་ཆོས་ཀྱིས་སྦྲུམ་པར་གྱུར།
en: “She became pregnant through the power of the Dharma,

source: །མི་སྡུག་པ་ཡི་ཁྱེའུ་ཞིག་བྱུང་།
en: And an ugly son was born.

source: །བུང་བུའི་མགོ་ལ་བོང་མགྲིན་པོ།
en: He had the head, the neck,

source: །བོང་རྣ་པོ་ལ་བོང་གདོང་པོ།
en: The ears, and the face of a donkey.

source: །ཐམས་ཅད་རྩུབ་པོ་རལ་པ་ཅན།
en: “His head was repulsive and covered with matted hairs,

source: །མི་ཡི་ལུས་ནི་ཕྱེད་ཡོད་པ།
en: But the other half of his body was human.

source: །དེ་མཐོང་འཇིགས་ནས་མྱུར་དུ་ནི།
en: When she saw him, the queen panicked

source: །སྣམ་ཕྱི་སར་ནི་དེ་བོར་རོ།
en: And quickly abandoned him in the latrines.

source: །རེག་ཏུ་མི་རུང་མི་གཙང་བ།
en: “Because he was filthy and disgusting to touch,
